STMicroelectronics/STM32CubeC5/examples/hal/smartcard/com_dma/NUCLEO-C562RE/generated/hal/mx_gpio_default.h
/**
  ******************************************************************************
  * @file           : mx_gpio_default.h
  * @brief          : Header for mx_gpio_default.c file.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the mx_stm32c5xx_hal_drivers_license.md file
  * in the same directory as the generated code.
  * If no mx_stm32c5xx_hal_drivers_license.md file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef MX_GPIO_DEFAULT_H
#define MX_GPIO_DEFAULT_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"
#include "mx_def.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/******************************************************************************/
/* Exported defines for gpio_default in HAL layer (SW instance MyGPIO_1) */
/******************************************************************************/

/* Primary aliases for GPIO PA0 pin */
#define PA0_PORT                                        HAL_GPIOA
#define PA0_PIN                                         HAL_GPIO_PIN_0
#define PA0_INIT_STATE                                  HAL_GPIO_PIN_RESET
#define PA0_ACTIVE_STATE                                HAL_GPIO_PIN_SET
#define PA0_INACTIVE_STATE                              HAL_GPIO_PIN_RESET

/* Secondary aliases for GPIO PA0 pin */
#define SC_RESET_PIN_PORT                               HAL_GPIOA
#define SC_RESET_PIN_PIN                                HAL_GPIO_PIN_0
#define SC_RESET_PIN_INIT_STATE                         HAL_GPIO_PIN_RESET
#define SC_RESET_PIN_ACTIVE_STATE                       HAL_GPIO_PIN_SET
#define SC_RESET_PIN_INACTIVE_STATE                     HAL_GPIO_PIN_RESET

/* Primary aliases for GPIO PA4 pin */
#define PA4_PORT                                        HAL_GPIOA
#define PA4_PIN                                         HAL_GPIO_PIN_4

/* Secondary aliases for GPIO PA4 pin */
#define SC_OFF_PIN_PORT                                 HAL_GPIOA
#define SC_OFF_PIN_PIN                                  HAL_GPIO_PIN_4

/* Primary aliases for GPIO PA5 pin */
#define PA5_PORT                                        HAL_GPIOA
#define PA5_PIN                                         HAL_GPIO_PIN_5
#define PA5_INIT_STATE                                  HAL_GPIO_PIN_RESET
#define PA5_ACTIVE_STATE                                HAL_GPIO_PIN_SET
#define PA5_INACTIVE_STATE                              HAL_GPIO_PIN_RESET

/* Primary aliases for GPIO PB0 pin */
#define PB0_PORT                                        HAL_GPIOB
#define PB0_PIN                                         HAL_GPIO_PIN_0
#define PB0_INIT_STATE                                  HAL_GPIO_PIN_RESET
#define PB0_ACTIVE_STATE                                HAL_GPIO_PIN_SET
#define PB0_INACTIVE_STATE                              HAL_GPIO_PIN_RESET

/* Secondary aliases for GPIO PB0 pin */
#define SC_3_5V_PIN_PORT                                HAL_GPIOB
#define SC_3_5V_PIN_PIN                                 HAL_GPIO_PIN_0
#define SC_3_5V_PIN_INIT_STATE                          HAL_GPIO_PIN_RESET
#define SC_3_5V_PIN_ACTIVE_STATE                        HAL_GPIO_PIN_SET
#define SC_3_5V_PIN_INACTIVE_STATE                      HAL_GPIO_PIN_RESET

/* Primary aliases for GPIO PC5 pin */
#define PC5_PORT                                        HAL_GPIOC
#define PC5_PIN                                         HAL_GPIO_PIN_5
#define PC5_INIT_STATE                                  HAL_GPIO_PIN_RESET
#define PC5_ACTIVE_STATE                                HAL_GPIO_PIN_SET
#define PC5_INACTIVE_STATE                              HAL_GPIO_PIN_RESET

/* Secondary aliases for GPIO PC5 pin */
#define SC_CMDVCC_PIN_PORT                              HAL_GPIOC
#define SC_CMDVCC_PIN_PIN                               HAL_GPIO_PIN_5
#define SC_CMDVCC_PIN_INIT_STATE                        HAL_GPIO_PIN_RESET
#define SC_CMDVCC_PIN_ACTIVE_STATE                      HAL_GPIO_PIN_SET
#define SC_CMDVCC_PIN_INACTIVE_STATE                    HAL_GPIO_PIN_RESET

/* Exported macros -----------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */
/******************************************************************************/
/* Exported functions for gpio_default in HAL layer (SW instance MyGPIO_1) */
/******************************************************************************/
/**
  * @brief mx_gpio_default init function
  * This function configures the hardware resources used in this example
  * @retval 0  GPIO group correctly initialized
  * @retval -1 Issue detected during GPIO group initialization
  */
system_status_t mx_gpio_default_init(void);

/**
  * @brief  De-initialize gpio_default instance.
  */
system_status_t mx_gpio_default_deinit(void);

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* MX_GPIO_DEFAULT_H */
